- Problem Overview: Summarize task (e.g., classification) and real-world relevance (1 para).
- Data & EDA: Describe source; visualize distributions/correlations; note issues (e.g., missing values).
- Preprocessing & Features: Detail cleaning, scaling/encoding, selection (e.g., correlation-based).
- Modeling: Train 1-2 models (e.g., logistic regression, random forest); basic tuning (e.g., grid search).
- Evaluation: Metrics (e.g., accuracy/F1); train-test split or CV; compare to original.
- Insights: Key findings, limitations, suggestions (e.g., add ensemble).

### Problem Overview
The Titanic dataset explores factors influencing survival during the Titanic tragedy. This is a classic binary classification problem, where the goal is to predict whether a passenger survived or not. The problem holds real-world relevance, as it highlights how various socioeconomic and demographic factors, such as age, sex, passenger class, and fare, can impact survival outcomes in disasters. By analyzing these data points, we can gain valuable insights into patterns of survival and human behavior under extreme circumstances.

### Data and EDA
The dataset comes from the Kaggle Titanic competition and contains information on 891 passengers from the training set. It includes 12 features such as passenger class (Pclass), name, sex, age, number of siblings/spouses aboard (SibSp), number of parents/children aboard (Parch), ticket number, fare, cabin, and port of embarkation. The target variable is 'Survived' (0 = died, 1 = survived).

In [2]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

train_data = pd.read_csv("./input/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S